package kotlinForProfi.Part3
//стр69

fun main(){
    println("Оператор || - 'ИЛИ' Все выражение с этим оператором будет считаться истинным, если хотя бы одно из условий или оба( справа или слева от него истинно")
    println("Оператор && - 'И',требует чтобы оба условия – слева и справа от него – были ис« тинны, тогда все выражение будет истинно")
    println("Оператор ! - это оператор 'НЕ' возвращает значение обратному заданному ")



}
// Приоритет от высокого к низкому:
// ! логическое —не-
//< 'меньше чем(+ <= 'меньше или равно(+ > 'больше чем(+ >= 'больше или равно(
// == равно и != не равно
//&& логическое —и-
//|| логическое —или-

